In [1]:
#PANDAS SERIES

In [2]:
import pandas as pd
import numpy as np
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [3]:
obj2.index#print indexes

Index(['d', 'b', 'a', 'c'], dtype='object')

In [4]:
obj2['d'] = 6#change values on given indexes
obj2['a'] = -4

In [5]:
obj2

d    6
b    7
a   -4
c    3
dtype: int64

In [6]:
obj2[['c', 'a', 'd']]#just print thrree value pair

c    3
a   -4
d    6
dtype: int64

In [7]:
obj2[obj2 > 0]#print those which follow the rule which is greater than  0

d    6
b    7
c    3
dtype: int64

In [8]:
obj2 * 2#simple multiplication

d    12
b    14
a    -8
c     6
dtype: int64

In [9]:
np.exp(obj2)
#taking exponential

d     403.428793
b    1096.633158
a       0.018316
c      20.085537
dtype: float64

In [10]:
'b' in obj2#print boolean characters

True

In [11]:
'e' in obj2

False

In [12]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}#tak edictionary keys as indexes and values as values

In [13]:
obj3 = pd.Series(sdata)#created pandas series

In [14]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [15]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)#list as  index and dictinary values as  values 
obj4#missing value is replace by NAN

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [16]:
pd.isnull(obj4)#use to find missing data

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
pd.notnull(obj4)#use to find available data

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [18]:
obj3 + obj4#concatenate and print those which have data in both object three and four

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [19]:
obj4.name = 'population'#putting a column name and row name 
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [20]:
#We can change indexes in series
obj4.index = ["Ammar","ali","asad","samer"]

In [21]:
obj4

Ammar        NaN
ali      35000.0
asad     16000.0
samer    71000.0
Name: population, dtype: float64

# DATA FRAME

In [22]:
import pandas as pd
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],# data frame is suitable for dictionary because keys are considered as column name and values are rows
 'year': [2000, 2001, 2002, 2001, 2002, 2003],#indexes are given by default it can bechange by certain methods
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame
#here comes data frames combination of several series takes dictionary keys as column name and values as column values

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [23]:
frame.head()#gives first five elements of the Data

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [24]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])
#We can change the sequence in this way

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [25]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four','five', 'six'])
frame2 #If one column is inserted having no value then it will be NAN value

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [26]:
#how to retrive rows and columns in DATAFRAME

In [27]:
#RETRIVE COLUMNS IN PYTHON
frame2.year#attribute method 
print()
frame2['year']#indexing method both have same job

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [28]:
#RETERIVING ROWS we use loc command
frame2.loc['three']#this is index we have to put it to get desire row

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [29]:
frame2['debt'] = 16.5#column modification
frame2.head()

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [30]:
import numpy as np
frame2['debt']=np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [31]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])#we insert element in column by this method because this is more appropriate
frame2['debt'] = val
frame2#fill values through pandas series

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [32]:
frame2['eastern'] = frame2.state == 'Ohio'#this line just put true if state == Ohio and it is inserted in column eastern
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [33]:
del frame2['eastern']
print(frame2.columns)
frame2

Index(['year', 'state', 'pop', 'debt'], dtype='object')

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [34]:
#NESTED DATA IN DATAFRAME
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}#dict in dict
#dataframeconsider key of outer dictionary as columns and inner dict key as rows and its value then printed
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [35]:
#we can transpose this by apply T
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [36]:
pd.DataFrame(pop, index=[2001, 2002, 2003]) #if we give indexes then inner dict keys are not considered as index

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [37]:
pdata = {'Ohio': frame3['Ohio'][:-1],# this is just accesing of elements in complex way but it is simple
'Nevada': frame3['Nevada'][:2]}#just give two elements last one is not considered
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [38]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3 #we can give heading on index column and column heading

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [39]:
#attribute values give you values in data frame
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [40]:
frame2.values#if dtype of evrey coulumn is different

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

# INDEX OBJECTS

In [41]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
obj

a    0
b    1
c    2
dtype: int64

In [42]:
index#getting index of series obj

Index(['a', 'b', 'c'], dtype='object')

In [43]:
# indexes are immutable
index[:1]

Index(['a'], dtype='object')

In [44]:
#index[1] = 'd' this command will not execute because it indexes are immutable

In [45]:
labels = pd.Index(np.arange(3))

In [46]:
labels#index creating in label variable

Int64Index([0, 1, 2], dtype='int64')

In [47]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [48]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [49]:
obj2.index is labels #checing either indexes are in variable labels or not

True

In [50]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [51]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [52]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64', name='year')

In [53]:
'Ohio' in frame3.columns

True

In [54]:
2003 in frame3.index#this can be perform in index also

False

In [55]:
#We can use double or same value as an index

In [56]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [57]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [58]:
l = pd.Series(np.arange(4),index = dup_labels)

In [59]:
l

foo    0
foo    1
bar    2
bar    3
dtype: int32

# REINDEXING

In [60]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj#just a simple series

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [61]:
obj=obj.reindex(['a','b','c','d','e'])
obj#if index value is not present then it places nan values

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [62]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3#it is some time require to fill the missing data so we use ffill method for this purpose

0      blue
2    purple
4    yellow
dtype: object

In [63]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [64]:
#Now comes dataframe in this context
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a','c','d'],
                     columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [65]:
frame2=frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [66]:
frame=frame.reindex(columns=['Ohio','Utha','Texas'])
frame#we should specifybwhat we are reindexing row or coumn we put columns= to tell that we are reindexing in column

   Ohio  Utha  Texas
a     0   NaN      1
c     3   NaN      4
d     6   NaN      7

# DROPING ENTRIES FROM AN AXIS

In [67]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [68]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [69]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [70]:
obj.drop(['d','c'])#drop method is use to eliminate any key value pair from a dictionary

a    0.0
b    1.0
e    4.0
dtype: float64

In [71]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data#now start droping in DataFrame

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [72]:
data.drop(['Ohio','Colorado'])#in this command axis is zero by default

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
data.drop('two',axis=1)#This will drop data from column because axis 1 = column

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [74]:
data.drop(['one','three'],axis='columns')#We can write columns instead of 1 but one is more prefareable

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [75]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [76]:
obj.drop('c',inplace=True)

In [77]:
obj#inplace basically permenantly drop data from series or dataframe

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

# INDEXING AND SLICING

In [78]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj  #just pandas series indexing

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [79]:
obj['b']

1.0

In [80]:
obj[1:3]#take number istead of string index you can also take string indexes

b    1.0
c    2.0
dtype: float64

In [81]:
obj[['b','a','c']]#we past list of indexes in to slice the series in order we want

b    1.0
a    0.0
c    2.0
dtype: float64

In [82]:
obj[[1,3]]#we take numbers also

b    1.0
d    3.0
dtype: float64

In [83]:
obj[obj<2]#can also take boolean arguments

a    0.0
b    1.0
dtype: float64

In [84]:
obj['a':'d']

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [85]:
obj['b':'d']=5#we can also assign new values to indexs through slicing
obj

a    0.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [86]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data#Now we start indexing in the dataframe here comlexity occurs

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [87]:
data['two']#it gives the two column values

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [88]:
data[['three', 'one']]#we can pass more then one index using list

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [89]:
data[:2]#now for rows it will give only two rows of dataframe

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [90]:
data[data['three'] > 5]#it prints all values where column three value is greater than 5

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
data<5#give boolean values for our search

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [92]:
data[data<5]=0#we assign all values less than 5 equals to zero
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# SELECTING WITH LOC AND ILOC

In [93]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [94]:
#loc is for axis label or should I say strings and iloc is for integers may amybe not

In [95]:
data.loc['Colorado',['two','three','four']]#loc we gives string before , is row name and after , is column name

two      5
three    6
four     7
Name: Colorado, dtype: int32

In [96]:
data.iloc[2,[0,2,3]]#in this we give numbers instead of string here before , is row ad after , is column

one       8
three    10
four     11
Name: Utah, dtype: int32

In [97]:
data.iloc[2]#gives details of row 3

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [98]:
data.iloc[[1,2],[2,3]]#by this we get dataframe here first list points rows and second list is for column values

          three  four
Colorado      6     7
Utah         10    11

In [99]:
data.loc[:'Utah','two']#we can use colon like representation to all before colon right hand side including it is pointed

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [100]:
data.iloc[:,:3]#we can use colon method in iloc too

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [101]:
data.iloc[:,:3][data.three>5]#optional condition can be given by using this method

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [102]:
#df[val] Select single column or sequence of columns from the DataFrame; special case conveniencesboolean array (filter rows), slice (slice rows), or boolean DataFrame

#df.loc[val] Selects single row or subset of rows from the DataFrame by label
#df.loc[:, val] Selects single column or subset of columns by labe
#df.loc[val1, val2] Select both rows and columns by label
#df.iloc[where] Selects single row or subset of rows from the DataFrame by integer position
#df.iloc[:, where] Selects single column or subset of columns by integer position
#df.iloc[where_i, where_j] Select both rows and columns by integer position
#df.at[label_i, label_j] Select a single scalar value by row and column label

# INTEGER INDEXES

In [103]:
ser=pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [104]:
#ser[-1] by this command compiler gives error so by removing it we will change index values

In [105]:
ser2=pd.Series(np.arange(3.),index=['a','b','c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [106]:
ser2[-1]#This doesnot generate error because we change index values

2.0

In [107]:
ser[:1]

0    0.0
dtype: float64

In [108]:
ser.iloc[:1]

0    0.0
dtype: float64

In [109]:
ser.loc[:1]#This is supersing

0    0.0
1    1.0
dtype: float64

# Artematic and data Alignment

In [110]:
#pandas data series can be added

In [111]:
s1=pd.Series(np.arange(5.),index=['a','b','c','d','e'])
s2=pd.Series(np.arange(5.),index=['b','c','d','f','g'])
s2

b    0.0
c    1.0
d    2.0
f    3.0
g    4.0
dtype: float64

In [112]:
s=s1+s2
s#it adds same index values and return nan where index are not presen in both series

a    NaN
b    1.0
c    3.0
d    5.0
e    NaN
f    NaN
g    NaN
dtype: float64

In [113]:
#Now here comes case of dataframe
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [114]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [115]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [116]:
d=df1+df2
d#because coloumn c and e is not present in both dataframe so they are fill with nan values

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [117]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df1#we just make small dataframe for clear insight

   A
0  1
1  2

In [118]:
df2

   B
0  3
1  4

In [119]:
c=df1+df2
c#because they donot have similar columns

    A   B
0 NaN NaN
1 NaN NaN

# Arithmetic methods with fill values

In [120]:
#now we willsee how to fill nan values

In [121]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [122]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [123]:
df2.loc[1,'b']=np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [124]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [125]:
d=df1+df2
d#same is done as in the data series

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [126]:
df1.add(df2, fill_value=0)#This add df1 and df2 and place that value zero which is not present in any of the data frame

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [127]:
1/df1#inf 1/0 is infinity that is why inf has arrived

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [128]:
df1.rdiv(1)#basically methods can be give to data fram just put r in start of them like radd,rsub,rmul

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [129]:
df1.radd(1)

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [130]:
df1.rmul(2)

      a     b     c     d
0   0.0   2.0   4.0   6.0
1   8.0  10.0  12.0  14.0
2  16.0  18.0  20.0  22.0

In [131]:
df1.rfloordiv(100)#method for floor division

      a      b     c     d
0   NaN  100.0  50.0  33.0
1  25.0   20.0  16.0  14.0
2  12.0   11.0  10.0   9.0

# Operations Between DataFrame and Series

In [132]:
arr = np.arange(12.).reshape((3, 4))#numpy array
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [133]:
arr[0]

array([0., 1., 2., 3.])

In [134]:
arr-arr[0]#subtraction in numpy array in which a[0] is subtracted by every row in the arr

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [135]:
#This is called broad Casting

In [136]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [137]:
series = frame.iloc[0]
series#just created series with data frame

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [138]:
frame-series#same operation as done in numpy can be done in series and data frame

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [139]:
series2=pd.Series(range(3),index=['b','e','f'])
series2#if index is not found in data frame or in series pandas will return nan value

b    0
e    1
f    2
dtype: int64

In [140]:
frame + series2#as I said above

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [141]:
#if we want to broad cast over column then we have to use arthematic method

In [142]:
series3 = frame['d']

In [143]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [144]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [145]:
frame.sub(series3,axis='index')#this will subtract from columns means series three is subtracted from every column

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

# Function application and Mapping

In [146]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

frame

               b         d         e
Utah    0.203190 -1.803311 -0.492478
Ohio    1.898812 -1.293210 -2.909030
Texas   1.053331  1.950815 -0.165084
Oregon  1.260957 -0.495939 -0.800812

In [147]:
np.abs(frame)#print absulote values of the frame

               b         d         e
Utah    0.203190  1.803311  0.492478
Ohio    1.898812  1.293210  2.909030
Texas   1.053331  1.950815  0.165084
Oregon  1.260957  0.495939  0.800812

In [148]:
f=lambda x:x.max()-x.min() #create a function lamda which gives maximum -minimum

In [149]:
frame.apply(f)#apply method applies function on frame

b    1.695622
d    3.754126
e    2.743946
dtype: float64

In [150]:
frame.apply(f,axis='columns')
#when you wnt to do aove operation columnwise

Utah      2.006501
Ohio      4.807842
Texas     2.115899
Oregon    2.061770
dtype: float64

In [151]:
frame.max()-frame.min()

b    1.695622
d    3.754126
e    2.743946
dtype: float64

In [154]:
foormat = lambda x: '%.2f' % x#tis command is not executiong i
frame.apply(foormat)

TypeError: ("cannot convert the series to <class 'float'>", 'occurred at index b')

# SORTING AND RANKING

In [155]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()#This sort the series index vise in alphabatic order

a    1
b    2
c    3
d    0
dtype: int64

In [156]:
obj.sort_values()#This command sort the series by values in numeric order

d    0
a    1
b    2
c    3
dtype: int64

In [157]:
#Now comes dataframe in the list
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['ammar', 'ali'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
ammar  0  1  2  3
ali    4  5  6  7

In [158]:
frame.sort_index()#it is basically adding ascii character values and then sort it

       d  a  b  c
ali    4  5  6  7
ammar  0  1  2  3

In [159]:
frame.sort_index(axis=1)#same thing is done but we have to mention axis

       a  b  c  d
ammar  1  2  3  0
ali    5  6  7  4

In [160]:
frame.sort_index(axis=1, ascending=False)#by this method we sort data in desending order

       d  c  b  a
ammar  0  3  2  1
ali    4  7  6  5

In [161]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()#nan value will always be at the end in sorting the series

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [162]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [163]:
frame.sort_values(by='b')#by this method we can sort any specific column

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [164]:
frame.sort_values(by=['a','b'])#sorting can be done column wise on many columns

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [165]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()#this is like sorting giving specific rank

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [166]:
obj.rank(method='first')#rank and also be assign according to order in which they are obsereved in data

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [167]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [168]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [169]:
frame.rank(axis='columns')#giving rank on basis of columns in dataframe

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [170]:
''''average' Default: assign the average rank to each entry in the equal group
'min' Use the minimum rank for the whole group
'max' Use the maximum rank for the whole group
'first' Assign ranks in the order the values appear in the data
'dense' Like method='min', but ranks always increase by 1 in between groups rather than the number of equal
elements in a group
'''

"'average' Default: assign the average rank to each entry in the equal group\n'min' Use the minimum rank for the whole group\n'max' Use the maximum rank for the whole group\n'first' Assign ranks in the order the values appear in the data\n'dense' Like method='min', but ranks always increase by 1 in between groups rather than the number of equal\nelements in a group\n"

# AXIS INDEXES WITH DUPLICATE VARIABLES:

In [171]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])#indexs have same values
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [172]:
obj.index.is_unique#tells whether the index have unique vzlues

False

In [173]:
obj['a']#index with multiple entries return a series

a    0
a    1
dtype: int64

In [174]:
obj['c']#it gives only value

4

In [175]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.985373  0.427093 -0.769103
a -0.772904 -0.237973 -0.021124
b -0.075899  1.212071 -0.453467
b -0.798307 -0.571010 -0.273544

In [176]:
df.loc['b']#returns another dataframe

          0         1         2
b -0.075899  1.212071 -0.453467
b -0.798307 -0.571010 -0.273544

# Summarizing and computing Descriptive Statics

In [177]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [178]:
df.sum()#pandas has built in capabailty to deal with nan data as like numpy

one    9.25
two   -5.80
dtype: float64

In [179]:
df.sum(axis=1)#This is done column wise adding column one and two

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [180]:
df.mean(axis='columns', skipna=False)#we pass an argument in it so it will compute nan value to

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [181]:
df.mean(axis='columns')#this command will not compute for nan values

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

df.idxmax()##return index where min or max value is attained

In [182]:
df.idxmax()##return index where min or max value is attained b has max value and d has min value

one    b
two    d
dtype: object

In [183]:
df.idxmin()#returns index where min value is attained d has min and b has max value

one    d
two    b
dtype: object

In [184]:
df.describe()#produce maximum minimum mean count st in one command called describe

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [185]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [186]:
'''count Number of non-NA values
describe Compute set of summary statistics for Series or each DataFrame column
min, max Compute minimum and maximum values
argmin, argmax Compute index locations (integers) at which minimum or maximum value obtained, respectively
idxmin, idxmax Compute index labels at which minimum or maximum value obtained, respectively
quantile Compute sample quantile ranging from 0 to 1
sum Sum of values
mean Mean of values
median Arithmetic median (50% quantile) of values
mad Mean absolute deviation from mean value
prod Product of all values
var Sample variance of values
std Sample standard deviation of values
skew Sample skewness (third moment) of values
kurt Sample kurtosis (fourth moment) of values
cumsum Cumulative sum of values
cummin, cummax Cumulative minimum or maximum of values, respectively
cumprod Cumulative product of values
diff Compute first arithmetic difference (useful for time series)
pct_change Compute percent changes
'''

'count Number of non-NA values\ndescribe Compute set of summary statistics for Series or each DataFrame column\nmin, max Compute minimum and maximum values\nargmin, argmax Compute index locations (integers) at which minimum or maximum value obtained, respectively\nidxmin, idxmax Compute index labels at which minimum or maximum value obtained, respectively\nquantile Compute sample quantile ranging from 0 to 1\nsum Sum of values\nmean Mean of values\nmedian Arithmetic median (50% quantile) of values\nmad Mean absolute deviation from mean value\nprod Product of all values\nvar Sample variance of values\nstd Sample standard deviation of values\nskew Sample skewness (third moment) of values\nkurt Sample kurtosis (fourth moment) of values\ncumsum Cumulative sum of values\ncummin, cummax Cumulative minimum or maximum of values, respectively\ncumprod Cumulative product of values\ndiff Compute first arithmetic difference (useful for time series)\npct_change Compute percent changes\n'

# Corelation And Covariance:

In [187]:
import pandas_datareader.data as web
#this is related to stock I should do it in my life

In [188]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
         for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
         for ticker, data in all_data.items()})

In [189]:
returns = price.pct_change()
returns.tail(12)

                AAPL       IBM      MSFT      GOOG
Date
2019-12-09 -0.014000  0.005254 -0.002570  0.002193
2019-12-10  0.005844 -0.000075 -0.001520  0.000819
2019-12-11  0.008529 -0.001120  0.003772  0.000268
2019-12-12  0.002548  0.011663  0.010152  0.003903
2019-12-13  0.013593 -0.008203  0.008418 -0.001807
2019-12-16  0.017118 -0.000596  0.006471  0.009897
2019-12-17  0.001965  0.000671 -0.005401 -0.004445
2019-12-18 -0.002389  0.001416 -0.002069 -0.001845
2019-12-19  0.001001  0.001116  0.008681  0.002528
2019-12-20 -0.002071  0.007655  0.010918 -0.004757
2019-12-23  0.016318 -0.000295  0.000000 -0.000556
2019-12-24  0.000951 -0.004205 -0.000191 -0.003914

In [190]:
returns['MSFT'].corr(returns['IBM'])#corr metod gives corelation between MSFT and IBM

0.4850388021526414

In [191]:
returns['MSFT'].cov(returns['IBM'])
#cov method calculate covariance

9.229209850791292e-05

# Unique Values,Value counts,Membership:

In [192]:
obj = pd.Series(['a','a','a','c','s','s','c','d'])

In [193]:
obj.unique()

array(['a', 'c', 's', 'd'], dtype=object)

In [194]:
obj.value_counts()#count number how many times arethey present in the list

a    3
c    2
s    2
d    1
dtype: int64

In [195]:
pd.value_counts(obj.values, sort=False)
#SEries will be sorted in descending order

a    3
d    1
s    2
c    2
dtype: int64

In [196]:
obj

0    a
1    a
2    a
3    c
4    s
5    s
6    c
7    d
dtype: object

In [197]:
mask= obj.isin(['b','c'])
mask

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
dtype: bool

In [198]:
obj[mask]#gives values whivh are present

3    c
6    c
dtype: object

In [199]:
 data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                      'Qu2': [2, 3, 1, 2, 3],
                      'Qu3': [1, 5, 2, 4, 4]})

In [200]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [201]:
result = data.apply(pd.value_counts).fillna(0)#this xommand count number of similar data in above dat frame and write it
result#if data is not present it will fill it by zero

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [202]:
result = data.apply(pd.value_counts)
result#this gives us nan value because we donot give fill method in this command

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

# CHAPTER 6 DEALING WITH REAL DATA

In [203]:
'''read_csv Load delimited data from a file, URL, or file-like object; use comma as default delimiter
read_table Load delimited data from a file, URL, or file-like object; use tab ('\t') as default delimiter
read_fwf Read data in fixed-width column format (i.e., no delimiters)
read_clipboard Version of read_table that reads data from the clipboard; useful for converting tables from web
pages
read_excel Read tabular data from an Excel XLS or XLSX file
read_hdf Read HDF5 files written by pandas
read_html Read all tables found in the given HTML document
read_json Read data from a JSON (JavaScript Object Notation) string representation
read_msgpack Read pandas data encoded using the MessagePack binary format
read_pickle Read an arbitrary object stored in Python pickle format
read_sas Read a SAS dataset stored in one of the SAS system’s custom storage formats
read_sql Read the results of a SQL query (using SQLAlchemy) as a pandas DataFrame
read_stata Read a dataset from Stata file format
read_feather Read the Feather binary file format'''

"read_csv Load delimited data from a file, URL, or file-like object; use comma as default delimiter\nread_table Load delimited data from a file, URL, or file-like object; use tab ('\t') as default delimiter\nread_fwf Read data in fixed-width column format (i.e., no delimiters)\nread_clipboard Version of read_table that reads data from the clipboard; useful for converting tables from web\npages\nread_excel Read tabular data from an Excel XLS or XLSX file\nread_hdf Read HDF5 files written by pandas\nread_html Read all tables found in the given HTML document\nread_json Read data from a JSON (JavaScript Object Notation) string representation\nread_msgpack Read pandas data encoded using the MessagePack binary format\nread_pickle Read an arbitrary object stored in Python pickle format\nread_sas Read a SAS dataset stored in one of the SAS system’s custom storage formats\nread_sql Read the results of a SQL query (using SQLAlchemy) as a pandas DataFrame\nread_stata Read a dataset from Stata file format\nread_feather Read the Feather binary file format"

In [204]:
#reading a csv file

In [205]:
df = pd.read_csv('Euro_2012_stats_TEAM.csv')

In [206]:
df#great converted csv file int data frame

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
0,Croatia,4.0,13.0,12.0,51.90%,16.00%,32.0,0.0,0.0,0.0,...,13.0,81.30%,41.0,62.0,2.0,9.0,0.0,9.0,9.0,16.0
1,Czech Republic,4.0,13.0,18.0,41.90%,12.90%,39.0,0.0,0.0,0.0,...,9.0,60.10%,53.0,73.0,8.0,7.0,0.0,11.0,11.0,19.0
2,Denmark,4.0,10.0,10.0,50.00%,20.00%,27.0,1.0,0.0,0.0,...,10.0,66.70%,25.0,38.0,8.0,4.0,0.0,7.0,7.0,15.0
3,England,5.0,11.0,18.0,50.00%,17.20%,40.0,0.0,0.0,0.0,...,22.0,88.10%,43.0,45.0,6.0,5.0,0.0,11.0,11.0,16.0
4,France,3.0,22.0,24.0,37.90%,6.50%,65.0,1.0,0.0,0.0,...,6.0,54.60%,36.0,51.0,5.0,6.0,0.0,11.0,11.0,19.0
5,Germany,10.0,32.0,32.0,47.80%,15.60%,80.0,2.0,1.0,0.0,...,10.0,62.60%,63.0,49.0,12.0,4.0,0.0,15.0,15.0,17.0
6,Greece,5.0,8.0,18.0,30.70%,19.20%,32.0,1.0,1.0,1.0,...,13.0,65.10%,67.0,48.0,12.0,9.0,1.0,12.0,12.0,20.0
7,Italy,6.0,34.0,45.0,43.00%,7.50%,110.0,2.0,0.0,0.0,...,20.0,74.10%,101.0,89.0,16.0,16.0,0.0,18.0,18.0,19.0
8,Netherlands,2.0,12.0,36.0,25.00%,4.10%,60.0,2.0,0.0,0.0,...,12.0,70.60%,35.0,30.0,3.0,5.0,0.0,7.0,7.0,15.0
9,Poland,2.0,15.0,23.0,39.40%,5.20%,48.0,0.0,0.0,0.0,...,6.0,66.70%,48.0,56.0,3.0,7.0,1.0,7.0,7.0,17.0
10,Portugal,6.0,22.0,42.0,34.30%,9.30%,82.0,6.0,0.0,0.0,...,10.0,71.50%,73.0,90.0,10.0,12.0,0.0,14.0,14.0,16.0
11,Republic of Ireland,1.0,7.0,12.0,36.80%,5.20%,28.0,0.0,0.0,0.0,...,17.0,65.40%,43.0,51.0,11.0,6.0,1.0,10.0,10.0,17.0
12,Russia,5.0,9.0,31.0,22.50%,12.50%,59.0,2.0,0.0,0.0,...,10.0,77.00%,34.0,43.0,4.0,6.0,0.0,7.0,7.0,16.0
13,Spain,12.0,42.0,33.0,55.90%,16.00%,100.0,0.0,1.0,0.0,...,15.0,93.80%,102.0,83.0,19.0,11.0,0.0,17.0,17.0,18.0
14,Sweden,5.0,17.0,19.0,47.20%,13.80%,39.0,3.0,0.0,0.0,...,8.0,61.60%,35.0,51.0,7.0,7.0,0.0,9.0,9.0,18.0
15,Ukraine,2.0,7.0,26.0,21.20%,6.00%,38.0,0.0,0.0,0.0,...,13.0,76.50%,48.0,31.0,4.0,5.0,0.0,9.0,9.0,18.0
16,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,https://towardsdatascience.com/data-handling-u...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [207]:
df1 = pd.read_csv('iris.csv')

In [208]:
df1

   2000-01-01  0
0  2000-01-02  1
1  2000-01-03  2
2  2000-01-04  3
3  2000-01-05  4
4  2000-01-06  5
5  2000-01-07  6

In [209]:
a=pd.read_table('iris.csv', sep=',')
a#this method can also be used but python suggest use read csv method

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   2000-01-01  0
0  2000-01-02  1
1  2000-01-03  2
2  2000-01-04  3
3  2000-01-05  4
4  2000-01-06  5
5  2000-01-07  6

In [210]:
b = pd.read_csv('iris.csv', header=None)
b.head()#Pandas will give default values to this data frame in column

            0  1
0  2000-01-01  0
1  2000-01-02  1
2  2000-01-03  2
3  2000-01-04  3
4  2000-01-05  4

In [211]:
c = df1.head()
c#this is just putting a slice of data frame into new variable

   2000-01-01  0
0  2000-01-02  1
1  2000-01-03  2
2  2000-01-04  3
3  2000-01-05  4
4  2000-01-06  5

In [212]:
pd.read_csv('abc.csv',index_col='Winner')#we can make any column as index of the data frame

ValueError: Index Winner invalid

In [213]:
parsed = pd.read_csv('iris.csv',
                     index_col=['variety','petal.width'])
parsed#in this if one column value is repeated many times then frame will adjust it in alphabetic order (herrical indexing)
#you can also try inde_col=['varity']

ValueError: Index variety invalid

In [214]:
#if we donot have proper csv then we will apply some methodstocnvert it int data frame

In [215]:
list(open('table.txt'))#by this methodwe select a txt file fromour current directory

['read_csv Load delimited data from a file, URL, or file-like object; use comma as default delimiter\n',
 "read_table Load delimited data from a file, URL, or file-like object; use tab ('\\t') as default delimiter\n",
 'read_fwf Read data in fixed-width column format (i.e., no delimiters)\n',
 'read_clipboard Version of read_table that reads data from the clipboard; useful for converting tables from web\n',
 'pages\n',
 'read_excel Read tabular data from an Excel XLS or XLSX file\n',
 'read_hdf Read HDF5 files written by pandas\n',
 'read_html Read all tables found in the given HTML document\n',
 'read_json Read data from a JSON (JavaScript Object Notation) string representation\n',
 'read_msgpack Read pandas data encoded using the MessagePack binary format\n',
 'read_pickle Read an arbitrary object stored in Python pickle format\n']

In [216]:
result = pd.read_csv('table.txt', sep='\s+').fillna('')
result

,read_csv,Load,delimited,data,from,a,"file,","URL,",or,file-like,object;,use,comma,as,default,delimiter
read_table,Load,delimited,data,from,a,"file,","URL,",or,file-like,object;,use,tab,('\t'),as,default,delimiter
read_fwf,Read,data,in,fixed-width,column,format,"(i.e.,",no,delimiters),,,,,,,
read_clipboard,Version,of,read_table,that,reads,data,from,the,clipboard;,useful,for,converting,tables,from,web,
pages,,,,,,,,,,,,,,,,
read_excel,Read,tabular,data,from,an,Excel,XLS,or,XLSX,file,,,,,,
read_hdf,Read,HDF5,files,written,by,pandas,,,,,,,,,,
read_html,Read,all,tables,found,in,the,given,HTML,document,,,,,,,
read_json,Read,data,from,a,JSON,(JavaScript,Object,Notation),string,representation,,,,,,
read_msgpack,Read,pandas,data,encoded,using,the,MessagePack,binary,format,,,,,,,
read_pickle,Read,an,arbitrary,object,stored,in,Python,pickle,format,,,,,,,

In [217]:
f = pd.read_csv('iris.csv')
f.head()

   2000-01-01  0
0  2000-01-02  1
1  2000-01-03  2
2  2000-01-04  3
3  2000-01-05  4
4  2000-01-06  5

In [218]:
g=pd.read_csv('iris.csv',skiprows=[1,2,3])#by this command we skip rows of data frame
g.head()

   2000-01-01  0
0  2000-01-05  4
1  2000-01-06  5
2  2000-01-07  6

In [219]:
'''path String indicating filesystem location, URL, or file-like object
sep or delimiter Character sequence or regular expression to use to split fields in each row
header Row number to use as column names; defaults to 0 (first row), but should be None if there is no
header row
index_col Column numbers or names to use as the row index in the result; can be a single name/number or a
list of them for a hierarchical index
names List of column names for result, combine with header=None
skiprows Number of rows at beginning of file to ignore or list of row numbers (starting from 0) to skip.
na_values Sequence of values to replace with NA.
comment Character(s) to split comments off the end of lines.
parse_dates Attempt to parse data to datetime; False by default. If True, will attempt to parse all columns.
Otherwise can specify a list of column numbers or name to parse. If element of list is tuple or list, will
combine multiple columns together and parse to date (e.g., if date/time split across two columns).
keep_date_col If joining columns to parse date, keep the joined columns; False by default.
converters Dict containing column number of name mapping to functions (e.g., {'foo': f} would apply the
function f to all values in the 'foo' column).
dayfirst When parsing potentially ambiguous dates, treat as international format (e.g., 7/6/2012 -> June 7,
2012); False by default.
date_parser Function to use to parse dates.
nrows Number of rows to read from beginning of file.
iterator Return a TextParser object for reading file piecemeal.
chunksize For iteration, size of file chunks.
skip_footer Number of lines to ignore at end of file.
verbose Print various parser output information, like the number of missing values placed in non-numeric
columns.
encoding Text encoding for Unicode (e.g., 'utf-8' for UTF-8 encoded text).
squeeze If the parsed data only contains one column, return a Series.
thousands Separator for thousands (e.g., ',' or '.').'''

"path String indicating filesystem location, URL, or file-like object\nsep or delimiter Character sequence or regular expression to use to split fields in each row\nheader Row number to use as column names; defaults to 0 (first row), but should be None if there is no\nheader row\nindex_col Column numbers or names to use as the row index in the result; can be a single name/number or a\nlist of them for a hierarchical index\nnames List of column names for result, combine with header=None\nskiprows Number of rows at beginning of file to ignore or list of row numbers (starting from 0) to skip.\nna_values Sequence of values to replace with NA.\ncomment Character(s) to split comments off the end of lines.\nparse_dates Attempt to parse data to datetime; False by default. If True, will attempt to parse all columns.\nOtherwise can specify a list of column numbers or name to parse. If element of list is tuple or list, will\ncombine multiple columns together and parse to date (e.g., if date/time split across two columns).\nkeep_date_col If joining columns to parse date, keep the joined columns; False by default.\nconverters Dict containing column number of name mapping to functions (e.g., {'foo': f} would apply the\nfunction f to all values in the 'foo' column).\ndayfirst When parsing potentially ambiguous dates, treat as international format (e.g., 7/6/2012 -> June 7,\n2012); False by default.\ndate_parser Function to use to parse dates.\nnrows Number of rows to read from beginning of file.\niterator Return a TextParser object for reading file piecemeal.\nchunksize For iteration, size of file chunks.\nskip_footer Number of lines to ignore at end of file.\nverbose Print various parser output information, like the number of missing values placed in non-numeric\ncolumns.\nencoding Text encoding for Unicode (e.g., 'utf-8' for UTF-8 encoded text).\nsqueeze If the parsed data only contains one column, return a Series.\nthousands Separator for thousands (e.g., ',' or '.')."

# READING TEXT FILES IN PIECES

In [220]:
pd.read_csv('iris.csv', nrows=5)
#by this we only read five rows of csv file.

   2000-01-01  0
0  2000-01-02  1
1  2000-01-03  2
2  2000-01-04  3
3  2000-01-05  4
4  2000-01-06  5

In [221]:
chunker = pd.read_csv('iris.csv', chunksize=1000)
chunker

In [222]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)
#this code basically count number of times single character is used 
tot[:10]

KeyError: 'key'

In [223]:
10000/7

1428.5714285714287

In [224]:
1428.57*3

4285.71

# Writting DATA TO TEXT FORMAT

In [225]:
data=pd.read_csv('iris.csv')
data.head()

   2000-01-01  0
0  2000-01-02  1
1  2000-01-03  2
2  2000-01-04  3
3  2000-01-05  4
4  2000-01-06  5

In [241]:
data.to_csv('abcd.csv')

In [ ]:
#da.to_csv('iris_csv')#I have to ask it with sir

In [234]:
data.to_csv('abcd.csv')
data#these methods are not working

   2000-01-01  0
0  2000-01-02  1
1  2000-01-03  2
2  2000-01-04  3
3  2000-01-05  4
4  2000-01-06  5
5  2000-01-07  6

In [228]:
import sys
data.to_csv(sys.stdout, sep=',')
#this method to convert csv int to plain text actually works

,2000-01-01,0
0,2000-01-02,1
1,2000-01-03,2
2,2000-01-04,3
3,2000-01-05,4
4,2000-01-06,5
5,2000-01-07,6

In [229]:
data.to_csv(sys.stdout, na_rep='NULL')#it will repalce empty string with null value

,2000-01-01,0
0,2000-01-02,1
1,2000-01-03,2
2,2000-01-04,3
3,2000-01-05,4
4,2000-01-06,5
5,2000-01-07,6

In [230]:
data.to_csv(sys.stdout, index=False, header=False)
#remove default index and column names by this command

2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [240]:
data.to_csv(sys.stdout, index=False, columns=['variety'])
#it gives specific column names and default index is still absent

KeyError: "None of [Index(['variety'], dtype='object')] are in the [columns]"

In [232]:
#Pandas series also have to csv method

# Working With Delimated Format

In [244]:
import csv
f = open('abc.csv')
readerr=csv.reader(f)
for line in readerr:
    print(line)#this is normal csv reading now from here I can convert it into any form

['', 'Unnamed: 0', 'sepal.length', 'sepal.width', 'petal.length', 'petal.width', 'variety']
['0', '0', '5.1', '3.5', '1.4', '0.2', 'Setosa']
['1', '1', '4.9', '3.0', '1.4', '0.2', 'Setosa']
['2', '2', '4.7', '3.2', '1.3', '0.2', 'Setosa']
['3', '3', '4.6', '3.1', '1.5', '0.2', 'Setosa']
['4', '4', '5.0', '3.6', '1.4', '0.2', 'Setosa']
['5', '5', '5.4', '3.9', '1.7', '0.4', 'Setosa']

In [246]:
header, values = readerr[0], readerr[1:]

data_dict = {h: v for h, v in zip(header, zip(*values))}
#why this code is not working

TypeError: '_csv.reader' object is not subscriptable

In [251]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f, dialect=my_dialect)
for line in reader:
    print(line)#it doesnot print any thing because we have dlimeter ; instead of ,

In [252]:
'''delimiter One-character string to separate fields; defaults to ','.
lineterminator Line terminator for writing; defaults to '\r\n'. Reader ignores this and recognizes cross-platform
line terminators.
quotechar Quote character for fields with special characters (like a delimiter); default is '"'.
quoting Quoting convention. Options include csv.QUOTE_ALL (quote all fields), csv.QUOTE_MINI
MAL (only fields with special characters like the delimiter), csv.QUOTE_NONNUMERIC, and
csv.QUOTE_NONE (no quoting). See Python’s documentation for full details. Defaults to
QUOTE_MINIMAL.
skipinitialspace Ignore whitespace after each delimiter; default is False.
doublequote How to handle quoting character inside a field; if True, it is doubled (see online documentation
for full detail and behavior).
escapechar String to escape the delimiter if quoting is set to csv.QUOTE_NONE; disabled by default.'''

'delimiter One-character string to separate fields; defaults to \',\'.\nlineterminator Line terminator for writing; defaults to \'\r\n\'. Reader ignores this and recognizes cross-platform\nline terminators.\nquotechar Quote character for fields with special characters (like a delimiter); default is \'"\'.\nquoting Quoting convention. Options include csv.QUOTE_ALL (quote all fields), csv.QUOTE_MINI\nMAL (only fields with special characters like the delimiter), csv.QUOTE_NONNUMERIC, and\ncsv.QUOTE_NONE (no quoting). See Python’s documentation for full details. Defaults to\nQUOTE_MINIMAL.\nskipinitialspace Ignore whitespace after each delimiter; default is False.\ndoublequote How to handle quoting character inside a field; if True, it is doubled (see online documentation\nfor full detail and behavior).\nescapechar String to escape the delimiter if quoting is set to csv.QUOTE_NONE; disabled by default.'

# JSON DATA

In [254]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
 {"name": "Katie", "age": 38,
 "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""#it is much more free form data as comare to csv or table form and become standaard to sent data on http protocol

In [256]:
import json
result = json.loads(obj)
result#just read json data using json.loads command

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [259]:
asjson = json.dumps(result)
asjson#this convert file back to json data using command json.dumps

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [260]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings#converted json data to dataframe by passing json dictionary and list parameters

    name  age
0  Scott   30
1  Katie   38

In [263]:
ammar = pd.DataFrame(result['places_lived'])
ammar#this is created by me

               0
0  United States
1          Spain
2        Germany

In [275]:
#data = pd.read_json('person.json',0)
#by above command you can directly convert json file into dataframe

ValueError: arrays must all be same length

In [276]:
'https://www.psx.com.pk/psx/exchange/psx-shareholder-information#float-shares'

SyntaxError: invalid syntax (<ipython-input-276-21fc07ff19f1>, line 1)

In [291]:
tables = pd.read_html('https://www.psx.com.pk/market-summary/')
tables#psx data scraped

[  Status: Open Volume: 157,218,060 Volume: 157,218,060.1  \
 0      Symbols        KSE100 Index        AllShare Index
 1  Advance 204    Current 40856.40      Current 29027.36
 2   Decline 99       High 40927.38         High 29189.09
 3  Unchange 14        Low 40328.32          Low 28866.37
 4    Total 317              528.08                160.99

   Value : 4,562,597,270 Value : 4,562,597,270.1            Trades: 45,450
 0          KSE 30 Index            KMI 30 Index  PSX-KMI All Shares Index
 1      Current 18743.30        Current 66004.23          Current 19342.87
 2         High 18748.74           High 66103.74             High 19386.92
 3          Low 18423.28            Low 65204.38              Low 19152.93
 4                320.02                  799.85                    189.94  ,
                                  AUTOMOBILE ASSEMBLER AUTOMOBILE ASSEMBLER.1  \
 0                                               SCRIP                   LDCP
 1                          Al-Ghazi Tractors Limited.                 366.75
 2   Dewan Farooque Motors Limited [ DEFAULTER SEGM...                   6.87
 3                           Ghandhara Industries Ltd.                 130.12
 4                               Ghandhara Nissan Ltd.                  75.17
 5                    Ghani Automobile Industries Ltd.                   4.61
 6                             Hino Pak Motor Limeted.                 474.16
 7                         Honda Atlas Cars (Pak) Ltd.                 212.63
 8                            Indus Motor Company Ltd.                1199.00
 9                            Millat Tractors Limited.                 696.91
 10                          Pak Suzuki Motors Co Ltd.                 224.21
 11                      Sazgar Engineering Works Ltd.                 228.89

    AUTOMOBILE ASSEMBLER.2 AUTOMOBILE ASSEMBLER.3 AUTOMOBILE ASSEMBLER.4  \
 0                    OPEN                   HIGH                    LOW
 1                  366.75                 370.00                 366.75
 2                    7.10                   7.10                   7.00
 3                  129.61                 134.50                 129.61
 4                   75.00                  77.40                  74.65
 5                    4.80                   4.80                   4.63
 6                  461.10                 489.99                 461.10
 7                  213.00                 216.57                 209.11
 8                 1180.24                1190.00                1180.20
 9                  690.00                 708.99                 685.00
 10                 224.20                 230.01                 218.10
 11                 233.26                 233.26                 233.26

    AUTOMOBILE ASSEMBLER.5 AUTOMOBILE ASSEMBLER.6 AUTOMOBILE ASSEMBLER.7
 0                 CURRENT                 CHANGE                 VOLUME
 1                  370.00                   3.25                    400
 2                    7.00                   0.13                  19500
 3                  133.00                   2.88                 258900
 4                   76.10                   0.93                 161500
 5                    4.71                   0.10                  12000
 6                  477.98                   3.82                    500
 7                  215.48                   2.85                 134100
 8                 1185.00                 -14.00                    920
 9                  701.00                   4.09                  18800
 10                 227.00                   2.79                 191100
 11                 233.26                   4.37                    100  ,
   AUTOMOBILE PARTS & ACCESSORIES AUTOMOBILE PARTS & ACCESSORIES.1  \
 0                          SCRIP                             LDCP
 1  Agriautos Industries Co. Ltd.                           205.68
 2             Atlas Battery Ltd.                           180.37
 3            Exide Pakistan Ltd.                           257.13
 4  General Tyre & Rubber Co.(XD)                            56.33
 5                 Loads Limited.                            16.61
 6                  Thal Limited.                           346.72

   AUTOMOBILE PARTS & ACCESSORIES.2 AUTOMOBILE PARTS & ACCESSORIES.3  \
 0                             OPEN                             HIGH
 1                           212.90                           212.90
 2                           180.00                           188.00
 3                           263.00                           263.00
 4                            56.60                            57.38
 5                            16.50                            17.00
 6                           346.70                           353.00

   AUTOMOBILE PARTS & ACCESSORIES.4 AUTOMOBILE PARTS & ACCESSORIES.5  \
 0                              LOW                          CURRENT
 1                           209.80                           209.80
 2                           180.00                           183.50
 3                           255.00                           255.00
 4                            55.35                            56.80
 5                            16.50                            16.74
 6                           340.11                           345.00

   AUTOMOBILE PARTS & ACCESSORIES.6 AUTOMOBILE PARTS & ACCESSORIES.7
 0                           CHANGE                           VOLUME
 1                             4.12                              200
 2                             3.13                             9600
 3                            -2.13                             2000
 4                             0.47                           221500
 5                             0.13                           171000
 6                            -1.72                             9600  ,
       CABLE & ELECTRICAL GOODS CABLE & ELECTRICAL GOODS.1  \
 0                        SCRIP                       LDCP
 1            Pak Elektron Ltd.                      26.12
 2         Pakistan Cables Ltd.                     127.00
 3  Siemens (Pak) Eng. Co. Ltd.                     820.00
 4   WAVES Singer Pakistan Ltd.                      24.50

   CABLE & ELECTRICAL GOODS.2 CABLE & ELECTRICAL GOODS.3  \
 0                       OPEN                       HIGH
 1                      26.45                      27.15
 2                     127.01                     127.01
 3                     827.47                     827.47
 4                      24.60                      25.44

   CABLE & ELECTRICAL GOODS.4 CABLE & ELECTRICAL GOODS.5  \
 0                        LOW                    CURRENT
 1                      26.25                      26.80
 2                     127.01                     127.01
 3                     827.47                     827.47
 4                      24.56                      25.03

   CABLE & ELECTRICAL GOODS.6 CABLE & ELECTRICAL GOODS.7
 0                     CHANGE                     VOLUME
 1                       0.68                    3313500
 2                       0.01                        100
 3                       7.47                         50
 4                       0.53                     172000  ,
                                           CEMENT CEMENT.1 CEMENT.2 CEMENT.3  \
 0                                          SCRIP     LDCP     OPEN     HIGH
 1                         Attock Cement Pak Ltd.    97.38    99.00    99.50
 2                        Bestway Cement Limited.   108.82   108.50   109.01
 3                         Cherat Cement Co. Ltd.    53.84    53.84    54.84
 4                     D. G. Khan Cement Co. Ltd.    73.99    74.20    75.89
 5   Dandot Cement Co. Ltd. [ DEFAULTER SEGMENT ]    11.28    10.28    11.00
 6                          Dewan Cement Limited.     7.46     7.59     7.78
 7                           Fauji Cement Co Ltd.    15.77    15.98    15.99
 8                              Fecto Cement Ltd.    22.40    22.20    23.52
 9                          Gharibwal Cement Ltd.    13.88    14.00    14.10
 10                         Kohat Cement Co. Ltd.    78.37    79.50    79.50
 11                         Lucky Cement Limited.   421.26   421.00   424.00
 12                Maple Leaf Cement Factory Ltd.    22.26    22.50    22.75
 13                           Pioneer Cement Ltd.    29.16    29.54    29.80
 14                          Power cement Limited     5.84     5.99     6.00
 15                    Thatta Cement Company Ltd.    11.50    12.00    12.00

    CEMENT.4 CEMENT.5 CEMENT.6 CEMENT.7
 0       LOW  CURRENT   CHANGE   VOLUME
 1     98.00    99.10     1.72    40500
 2    108.50   109.00     0.18     4900
 3     53.84    54.50     0.66   535500
 4     74.02    75.31     1.32   804500
 5     10.28    11.00    -0.28    26500
 6      7.56     7.70     0.24   367500
 7     15.75    15.88     0.11  1810000
 8     22.20    23.52     1.12    16500
 9     13.80    13.81    -0.07    26000
 10    78.50    78.50     0.13     1500
 11   421.00   422.99     1.73   196100
 12    22.35    22.65     0.39  1541500
 13    29.05    29.70     0.54  1224500
 14     5.88     5.90     0.06  2138500
 15    11.25    11.50     0.00    54000  ,
                                           CHEMICAL CHEMICAL.1 CHEMICAL.2  \
 0                                            SCRIP       LDCP       OPEN
 1                                 Agritech Limited       4.32       4.38
 2                     Akzo Nobel Pakistan Limited.     258.72     260.00
 3   Bawany Air Products Ltd. [ DEFAULTER SEGMENT ]      26.28      27.59
 4                      Berger Paints Pakistan Ltd.      80.46      81.50
 5                         Bifo Industries Ltd.(XD)     174.37     175.00
 6                                Buxly Paints Ltd.      45.50      46.00
 7                     Colgate Palmolive (Pak) Ltd.    2300.00    2300.00
 8                                Data Agro Limited       9.40       9.50
 9                              Descon Oxychem Ltd.      21.55      21.15
 10                  Engro Polymer & Chemicals Ltd.      33.54      33.54
 11                  Ghani Global Holdings Limited.      13.34      13.60
 12                           ICI Pakistan Limited.     636.28     644.00
 13                           Ittehad Chemical Ltd.      22.56      23.00
 14                    Lotte Chemical Pakistan Ltd.      13.89      13.97
 15                  Nimir Industrial Chemical Ltd.      57.50      56.50
 16                           Nimir Resins Limited.       7.02       7.15
 17                        Pakistan Oxygen Limited.     166.90        0.0
 18                  Sardar Chemical IndustriesLtd.      16.76      16.76
 19                         Sitara Peroxide Limited      20.02      20.35
 20                        Wah Noble Chemicals Ltd.     218.00     215.00

    CHEMICAL.3 CHEMICAL.4 CHEMICAL.5 CHEMICAL.6 CHEMICAL.7
 0        HIGH        LOW    CURRENT     CHANGE     VOLUME
 1        4.40       4.25       4.35       0.03     198500
 2      268.90     254.11     255.00      -3.72     206000
 3       27.59      27.59      27.59       1.31      22500
 4       82.00      81.50      82.00       1.54       2000
 5      178.00     174.90     177.00       2.63      14700
 6       46.00      46.00      46.00       0.50       2000
 7     2300.00    2300.00    2300.00       0.00         20
 8        9.89       9.02       9.02      -0.38       2500
 9       22.00      21.15      21.84       0.29     150500
 10      35.11      33.49      34.75       1.21    4256000
 11      14.34      13.50      14.34       1.00    1354500
 12     664.00     644.00     660.50      24.22     133700
 13      23.19      22.71      23.19       0.63      25000
 14      14.17      13.90      14.10       0.21    2138000
 15      56.50      56.00      56.00      -1.50       3500
 16       7.29       7.05       7.10       0.08     268500
 17          0          0     173.89        0.0       4000
 18      16.76      16.76      16.76       0.00       5000
 19      20.55      20.15      20.50       0.48      60500
 20     215.00     215.00     215.00      -3.00        200  ,
                    COMMERCIAL BANKS COMMERCIAL BANKS.1 COMMERCIAL BANKS.2  \
 0                             SCRIP               LDCP               OPEN
 1                  Allied Bank Ltd.              98.19              99.74
 2              Askari Bank Limited.              18.66              18.70
 3                Bank Al-Habib Ltd.              75.29              76.50
 4                 Bank Alfalah Ltd.              45.17              45.79
 5                   Bank Of Punjab.              11.40              11.51
 6          Bankislami Pakistan Ltd.              11.47              11.45
 7              Faysal Bank Limited.              18.73              19.20
 8               Habib Bank Limited.             157.34             159.79
 9   Habib Metropolitn Bank Limited.              35.90              36.00
 10                 JS Bank Limited.               5.39               5.49
 11                MCB Bank Limited.             207.42             209.00
 12         Meezan Bank Limited.(XD)              93.20              94.00
 13       National Bank Of Pakistan.              44.21              44.25
 14              Samba Bank Limited.               7.98               6.98
 15               Silk Bank Limited.               1.01               1.03
 16                 Soneri Bank Ltd.               9.85               9.99
 17             Summit Bank Limited.               1.11               1.14
 18              The Bank of Khyber.              13.00              12.51
 19                 United Bank Ltd.             164.26             165.00

    COMMERCIAL BANKS.3 COMMERCIAL BANKS.4 COMMERCIAL BANKS.5  \
 0                HIGH                LOW            CURRENT
 1               99.74              97.99              98.80
 2               18.94              18.50              18.77
 3               77.00              76.00              76.90
 4               46.75              45.49              46.25
 5               11.79              11.36              11.65
 6               11.67              11.45              11.65
 7               19.40              19.10              19.18
 8              163.00             158.01             163.00
 9               36.50              36.00              36.15
 10               5.49               5.40               5.45
 11             210.75             207.50             209.90
 12              97.00              94.00              96.10
 13              45.10              44.20              45.00
 14               6.98               6.98               6.98
 15               1.05               1.02               1.02
 16               9.99               9.75               9.80
 17               1.20               1.14               1.20
 18              13.00              12.25              13.00
 19             170.00             165.00             168.99

    COMMERCIAL BANKS.6 COMMERCIAL BANKS.7
 0              CHANGE             VOLUME
 1                0.61              35000
 2                0.11             190000
 3                1.61              63500
 4                1.08             551500
 5                0.25            4091500
 6                0.18             265500
 7                0.45              44500
 8                5.66             223800
 9                0.25              11500
 10               0.06              20500
 11               2.48              61600
 12               2.90              96000
 13               0.79            1275500
 14              -1.00                500
 15               0.01            1879500
 16              -0.05              51000
 17               0.09             155500
 18               0.00               8000
 19               4.73             316600  ,
                                           ENGINEERING ENGINEERING.1  \
 0                                               SCRIP          LDCP
 1                          Aisha Steel Mills Limited.          9.32
 2                              Amreli Steels Limited.         35.16
 3                    Crescent Steel & Allied Product.         50.58
 4              Dost Steels Ltd. [ DEFAULTER SEGMENT ]          4.93
 5         Drekkar Kingsway Ltd. [ DEFAULTER SEGMENT ]          2.50
 6   Huffaz Seamless Pipe Industrie. [ DEFAULTER SE...         15.75
 7                       International Industries Ltd.        104.80
 8                       International Steels Limited.         56.46
 9                    Ittefaq Iron Industries Limited.          9.75
 10                                  KSB Pumps Co Ltd.        155.50
 11                      Mughal Iron & Steels Ind Ltd.         38.25
 12  Pakistan Engineering Co Ltd. [ DEFAULTER SEGME...        106.11

    ENGINEERING.2 ENGINEERING.3 ENGINEERING.4 ENGINEERING.5 ENGINEERING.6  \
 0           OPEN          HIGH           LOW       CURRENT        CHANGE
 1           9.49          9.98          9.25          9.80          0.48
 2          35.30         36.66         35.10         36.15          0.99
 3          52.70         52.70         51.00         51.00          0.42
 4           4.90          5.10          4.84          4.91         -0.01
 5           2.16          2.68          2.16          2.50          0.00
 6          15.51         16.49         15.51         16.45          0.70
 7         106.50        108.90        105.42        106.90          2.10
 8          57.00         58.70         56.75         58.00          1.54
 9           9.88         10.00          9.75          9.85          0.10
 10        162.99        163.27        162.99        163.27          7.77
 11         38.50         39.75         38.35         39.50          1.25
 12        100.81        111.41        100.81        111.41          5.30

    ENGINEERING.7
 0         VOLUME
 1         285500
 2         958000
 3          14500
 4         461000
 5           6500
 6           2000
 7        1337500
 8        1532500
 9         280500
 10          4300
 11        436000
 12           400  ,
                         FERTILIZER FERTILIZER.1 FERTILIZER.2 FERTILIZER.3  \
 0                            SCRIP         LDCP         OPEN         HIGH
 1      Arif Habib Corporation Ltd.        31.39        30.66        30.66
 2       Engro Corporation Limited.       328.46       329.01       331.98
 3       Engro Fertilizers Limited.        72.97        73.00        73.00
 4        Fatima Fertilizer Co Ltd.        26.00        26.50        26.50
 5  Fauji Fertilizer Bin Qasim Ltd.        19.41        19.70        19.90
 6        Fauji Fertilizer Co. Ltd.       101.93       102.50       102.99

   FERTILIZER.4 FERTILIZER.5 FERTILIZER.6 FERTILIZER.7
 0          LOW      CURRENT       CHANGE       VOLUME
 1        30.65        30.65        -0.74         1500
 2       329.00       330.48         2.02       121400
 3        71.88        72.90        -0.07       879000
 4        25.80        25.80        -0.20       107500
 5        19.45        19.75         0.34       749500
 6       102.00       102.99         1.06       198000  ,
            FOOD & PERSONAL CARE PRODUCTS FOOD & PERSONAL CARE PRODUCTS.1  \
 0                                  SCRIP                            LDCP
 1                Al-Shaheer Corporation.                           13.59
 2                          At-Tahur Ltd.                           19.84
 3               Clover Pakistan Limited.                          129.49
 4                   Fauji Foods Limited.                           14.33
 5   Frieslandcampina Engro Pakistan Ltd.                           79.90
 6                   Matco Foods Limited.                           25.31
 7             Mitchells Fruit Farms Ltd.                          340.49